
  <details>
  <summary>Click to expand</summary>

  ```terraform
  module.lambda.data.archive_file.token_refresh: Reading...
module.lambda.data.archive_file.token_refresh: Read complete after 0s [id=0a5ee18200d6ef0f79a444d2e6b317a84ea4c7ca]
module.secrets.aws_secretsmanager_secret.asgardeo["production"]: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:478468757808:secret:kubestock/production/asgardeo-TaqYrp]
module.ecr.aws_ecr_repository.microservices["kubestock/ms-supplier"]: Refreshing state... [id=kubestock/ms-supplier]
module.kubernetes.aws_iam_role.k8s_nodes: Refreshing state... [id=kubestock-node-role]
module.ecr.aws_ecr_repository.microservices["kubestock/ms-product"]: Refreshing state... [id=kubestock/ms-product]
module.secrets.aws_secretsmanager_secret.asgardeo["staging"]: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:478468757808:secret:kubestock/staging/asgardeo-wcyunr]
module.ecr.aws_ecr_repository.microservices["kubestock/ms-order-management"]: Refreshing state... [id=kubestock/ms-order-management]
module.compute.aws_key_pair.main: Refreshing state... [id=kubestock-key]
module.ecr.aws_ecr_repository.microservices["kubestock/web"]: Refreshing state... [id=kubestock/web]
data.aws_region.current: Reading...
module.ecr.aws_ecr_repository.microservices["kubestock/ms-inventory"]: Refreshing state... [id=kubestock/ms-inventory]
data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.secrets.aws_secretsmanager_secret.db["staging"]: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:478468757808:secret:kubestock/staging/db-TaqYrp]
module.secrets.aws_secretsmanager_secret.db["production"]: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:478468757808:secret:kubestock/production/db-P877dp]
module.ecr.aws_ecr_repository.microservices["kubestock/ms-identity"]: Refreshing state... [id=kubestock/ms-identity]
module.kubernetes.aws_iam_policy.k8s_ecr_pull: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-k8s-ecr-pull]
data.aws_caller_identity.current: Reading...
module.lambda.aws_cloudwatch_event_rule.token_refresh_schedule: Refreshing state... [id=kubestock-token-refresh-schedule]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0a65a6bd6be2223dc]
module.compute.data.aws_ami.ubuntu: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=478468757808]
module.cicd.data.aws_iam_openid_connect_provider.github_actions: Reading...
module.lambda.aws_iam_role.token_refresh: Refreshing state... [id=kubestock-token-refresh-lambda-role]
module.secrets.aws_iam_user.external_secrets: Refreshing state... [id=kubestock-external-secrets]
module.rds.aws_db_parameter_group.postgres: Refreshing state... [id=kubestock-postgres-params]
module.cicd.data.aws_iam_openid_connect_provider.github_actions: Read complete after 0s [id=arn:aws:iam::478468757808:oidc-provider/token.actions.githubusercontent.com]
module.kubernetes.aws_iam_policy.k8s_controllers: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-k8s-controllers-policy]
module.kubernetes.aws_iam_instance_profile.k8s_nodes: Refreshing state... [id=kubestock-node-profile]
module.kubernetes.aws_iam_role_policy_attachment.k8s_nodes_ssm: Refreshing state... [id=kubestock-node-role-20251122171458069900000001]
module.kubernetes.aws_iam_role_policy_attachment.k8s_ecr_pull: Refreshing state... [id=kubestock-node-role-20251206093956675200000001]
module.cicd.aws_iam_role.github_actions_ecr: Refreshing state... [id=KubeStock-github-actions-ecr-role]
module.secrets.aws_iam_access_key.external_secrets: Refreshing state... [id=AKIAW6ZXV3EYOXZTGH2U]
module.kubernetes.aws_iam_role_policy_attachment.k8s_controllers: Refreshing state... [id=kubestock-node-role-20251122171458070500000002]
module.lambda.aws_iam_policy.token_refresh: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-token-refresh-lambda-policy]
module.secrets.aws_iam_policy.external_secrets_read: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-external-secrets-read]
module.kubernetes.aws_iam_policy.k8s_external_secrets: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-k8s-external-secrets-policy]
module.kubernetes.aws_iam_role_policy.k8s_nodes_ssm_params: Refreshing state... [id=kubestock-node-role:k8s-nodes-ssm-policy]
module.lambda.aws_lambda_function.token_refresh: Refreshing state... [id=kubestock-refresh-join-token]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/ms-inventory"]: Refreshing state... [id=kubestock/ms-inventory]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/ms-supplier"]: Refreshing state... [id=kubestock/ms-supplier]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/ms-order-management"]: Refreshing state... [id=kubestock/ms-order-management]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/ms-product"]: Refreshing state... [id=kubestock/ms-product]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/web"]: Refreshing state... [id=kubestock/web]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/ms-identity"]: Refreshing state... [id=kubestock/ms-identity]
module.lambda.aws_iam_role_policy_attachment.token_refresh: Refreshing state... [id=kubestock-token-refresh-lambda-role-20251130171832420000000001]
module.secrets.aws_iam_user_policy_attachment.external_secrets_read: Refreshing state... [id=kubestock-external-secrets-20251206100114287600000001]
module.kubernetes.aws_iam_role_policy_attachment.k8s_external_secrets: Refreshing state... [id=kubestock-node-role-20251206092316623400000001]
module.cicd.aws_iam_policy.github_actions_ecr: Refreshing state... [id=arn:aws:iam::478468757808:policy/KubeStock-github-actions-ecr-policy]
module.cicd.aws_iam_role_policy_attachment.github_actions_ecr: Refreshing state... [id=KubeStock-github-actions-ecr-role-20251125155745016000000001]
module.compute.data.aws_ami.ubuntu: Read complete after 1s [id=ami-0ade68f094cc81635]
module.lambda.aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowEventBridgeInvoke]
module.lambda.aws_cloudwatch_log_group.token_refresh: Refreshing state... [id=/aws/lambda/kubestock-refresh-join-token]
module.lambda.aws_cloudwatch_event_target.token_refresh: Refreshing state... [id=kubestock-token-refresh-schedule-RefreshKubeToken]
module.networking.aws_internet_gateway.main: Refreshing state... [id=igw-01f445518c285bb47]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-0559dfc1c9f2ba26d]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-01240ef2e0b751289]
module.networking.aws_subnet.public[2]: Refreshing state... [id=subnet-0577be992dc0ab111]
module.networking.aws_subnet.private[2]: Refreshing state... [id=subnet-0780d8e640722a270]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-0b1dc7ca3ea5b0331]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-0537648f14b08fae9]
module.security.aws_security_group.dev_server: Refreshing state... [id=sg-0d67ff044a38749c1]
module.kubernetes.aws_lb_target_group.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-k8s-api-tg/0247a93887c9714b]
module.security.aws_security_group.k8s_common: Refreshing state... [id=sg-0b067e3fb603b11be]
module.security.aws_security_group.bastion: Refreshing state... [id=sg-0b8af5ccdc9c1d59a]
module.networking.aws_eip.nat: Refreshing state... [id=eipalloc-0343d1d2c3192b117]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-05c13f4e14ae0919a]
module.rds.aws_db_subnet_group.main: Refreshing state... [id=kubestock-db-subnet-group]
module.compute.aws_instance.dev_server: Refreshing state... [id=i-08c6d4bdb5a49427a]
module.security.aws_security_group.nlb_api: Refreshing state... [id=sg-0b0d4dba43b6333e3]
module.security.aws_security_group.workers: Refreshing state... [id=sg-08b85cb7308f90c2f]
module.compute.aws_instance.bastion: Refreshing state... [id=i-00f0ca79b9ce4c42b]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-032368bbbbdbffa70]
module.networking.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-072cb499e6ec152fc]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0382b6c798e2559df]
module.networking.aws_nat_gateway.main: Refreshing state... [id=nat-054ea26583c09fb63]
module.security.aws_security_group.control_plane: Refreshing state... [id=sg-0ac3836e0f42135fb]
module.kubernetes.aws_lb.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:loadbalancer/net/kubestock-nlb-api/9f36c11b9d916d59]
module.kubernetes.aws_launch_template.k8s_worker: Refreshing state... [id=lt-01159ecec1ce86876]
module.networking.aws_route_table.private[2]: Refreshing state... [id=rtb-04b01b74ef23587e6]
module.networking.aws_route_table.private[0]: Refreshing state... [id=rtb-06f165d277305b4f2]
module.networking.aws_route_table.private[1]: Refreshing state... [id=rtb-0b5da2e36e8f81b57]
module.security.aws_security_group.rds: Refreshing state... [id=sg-0beb81e7082e092e4]
module.kubernetes.aws_instance.control_plane: Refreshing state... [id=i-08ff658102a4848d6]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05cd7e585640a44e2]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0899b49bc97142ad1]
module.networking.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0861217d4449ff33d]
module.kubernetes.aws_autoscaling_group.k8s_workers: Refreshing state... [id=kubestock-workers-asg]
module.rds.aws_db_instance.production: Refreshing state... [id=db-BCZAHFE3G7WAETSZHTIH4JRG6M]
module.rds.aws_db_instance.staging: Refreshing state... [id=db-3X4DF5ESJAZVG6SGKJTFFOT2C4]
module.kubernetes.aws_lb_listener.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb-api/9f36c11b9d916d59/7ba42e9873ca8f56]
module.compute.aws_eip.bastion: Refreshing state... [id=eipalloc-0e7b598a9492e3186]
module.kubernetes.aws_lb_target_group_attachment.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-k8s-api-tg/0247a93887c9714b-2025112217153294790000000a]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.compute.aws_instance.dev_server has changed
  ~ resource "aws_instance" "dev_server" {
        id                                   = "i-08c6d4bdb5a49427a"
      ~ public_ip                            = "65.2.130.219" -> "3.111.150.114"
        tags                                 = {
            "Name" = "kubestock-dev-server"
            "Role" = "development"
        }
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.kubernetes.aws_lb.k8s_api has been deleted
  - resource "aws_lb" "k8s_api" {
      - arn                                                          = "arn:aws:elasticloadbalancing:ap-south-1:478468757808:loadbalancer/net/kubestock-nlb-api/9f36c11b9d916d59" -> null
      - dns_name                                                     = "kubestock-nlb-api-9f36c11b9d916d59.elb.ap-south-1.amazonaws.com" -> null
        id                                                           = "arn:aws:elasticloadbalancing:ap-south-1:478468757808:loadbalancer/net/kubestock-nlb-api/9f36c11b9d916d59"
        name                                                         = "kubestock-nlb-api"
        tags                                                         = {
            "Name" = "kubestock-nlb-api"
        }
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.compute.aws_eip.dev_server will be created
  + resource "aws_eip" "dev_server" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = "i-08c6d4bdb5a49427a"
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "kubestock-dev-server-eip"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "kubestock-dev-server-eip"
          + "Project"     = "KubeStock"
        }
      + vpc                  = (known after apply)
    }

  # module.compute.aws_instance.dev_server will be updated in-place
  ~ resource "aws_instance" "dev_server" {
        id                                   = "i-08c6d4bdb5a49427a"
      ~ public_dns                           = "ec2-3-111-150-114.ap-south-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.111.150.114" -> (known after apply)
        tags                                 = {
            "Name" = "kubestock-dev-server"
            "Role" = "development"
        }
      ~ user_data                            = "0a78962d6aa8e907c7fe8079e66e95a86773f3b9" -> "2186c6d5d7446ccda737796bb75d7f48bc8d2e0e"
        # (37 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.kubernetes.aws_autoscaling_attachment.argocd_ui will be created
  + resource "aws_autoscaling_attachment" "argocd_ui" {
      + autoscaling_group_name = "kubestock-workers-asg"
      + id                     = (known after apply)
      + lb_target_group_arn    = (known after apply)
    }

  # module.kubernetes.aws_autoscaling_attachment.staging_frontend_http will be created
  + resource "aws_autoscaling_attachment" "staging_frontend_http" {
      + autoscaling_group_name = "kubestock-workers-asg"
      + id                     = (known after apply)
      + lb_target_group_arn    = (known after apply)
    }

  # module.kubernetes.aws_autoscaling_attachment.staging_frontend_https will be created
  + resource "aws_autoscaling_attachment" "staging_frontend_https" {
      + autoscaling_group_name = "kubestock-workers-asg"
      + id                     = (known after apply)
      + lb_target_group_arn    = (known after apply)
    }

  # module.kubernetes.aws_lb.k8s_api will be created
  + resource "aws_lb" "k8s_api" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + dns_name                                                     = (known after apply)
      + dns_record_client_routing_policy                             = "any_availability_zone"
      + enable_cross_zone_load_balancing                             = true
      + enable_deletion_protection                                   = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "network"
      + name                                                         = "kubestock-nlb"
      + name_prefix                                                  = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-0537648f14b08fae9",
          + "subnet-0780d8e640722a270",
          + "subnet-0b1dc7ca3ea5b0331",
        ]
      + tags                                                         = {
          + "Name" = "kubestock-nlb"
        }
      + tags_all                                                     = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "kubestock-nlb"
          + "Project"     = "KubeStock"
        }
      + vpc_id                                                       = (known after apply)
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.kubernetes.aws_lb_listener.argocd_ui will be created
  + resource "aws_lb_listener" "argocd_ui" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 8443
      + protocol                                                              = "TCP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "KubeStock"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.kubernetes.aws_lb_listener.k8s_api will be created
  + resource "aws_lb_listener" "k8s_api" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 6443
      + protocol                                                              = "TCP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "KubeStock"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-k8s-api-tg/0247a93887c9714b"
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.kubernetes.aws_lb_listener.staging_frontend_http will be created
  + resource "aws_lb_listener" "staging_frontend_http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "TCP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "KubeStock"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.kubernetes.aws_lb_listener.staging_frontend_https will be created
  + resource "aws_lb_listener" "staging_frontend_https" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "TCP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "KubeStock"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.kubernetes.aws_lb_target_group.argocd_ui will be created
  + resource "aws_lb_target_group" "argocd_ui" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "kubestock-argocd-ui"
      + name_prefix                        = (known after apply)
      + port                               = 30443
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "kubestock-argocd-ui-tg"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "kubestock-argocd-ui-tg"
          + "Project"     = "KubeStock"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0a65a6bd6be2223dc"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "30443"
          + protocol            = "TCP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.kubernetes.aws_lb_target_group.staging_frontend_http will be created
  + resource "aws_lb_target_group" "staging_frontend_http" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "kubestock-staging-fe-http"
      + name_prefix                        = (known after apply)
      + port                               = 30080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "kubestock-staging-fe-http-tg"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "kubestock-staging-fe-http-tg"
          + "Project"     = "KubeStock"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0a65a6bd6be2223dc"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "30080"
          + protocol            = "TCP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.kubernetes.aws_lb_target_group.staging_frontend_https will be created
  + resource "aws_lb_target_group" "staging_frontend_https" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "kubestock-staging-fe-https"
      + name_prefix                        = (known after apply)
      + port                               = 30444
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "kubestock-staging-fe-https-tg"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "kubestock-staging-fe-https-tg"
          + "Project"     = "KubeStock"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0a65a6bd6be2223dc"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "30444"
          + protocol            = "TCP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.lambda.aws_lambda_function.token_refresh will be updated in-place
  ~ resource "aws_lambda_function" "token_refresh" {
        id                             = "kubestock-refresh-join-token"
      ~ last_modified                  = "2025-12-06T20:48:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "Foa22LXBsH1YQtNhT5qD7sUvQQc0on7JWd55ItJ0fVE=" -> "aIJSLgFJuFtGnUjPsmL9MuAHl8cVWCxpNYew8ugLa8U="
        tags                           = {
            "Name" = "kubestock-refresh-join-token"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.security.aws_security_group.control_plane will be updated in-place
  ~ resource "aws_security_group" "control_plane" {
        id                     = "sg-0ac3836e0f42135fb"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "K8s API from NLB"
              - from_port        = 6443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0b0d4dba43b6333e3",
                ]
              - self             = false
              - to_port          = 6443
            },
          + {
              + cidr_blocks      = []
              + description      = "K8s API from NLB"
              + from_port        = 6443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 6443
            },
            # (2 unchanged elements hidden)
        ]
        name                   = "kubestock-sg-control-plane"
        tags                   = {
            "Name" = "kubestock-sg-control-plane"
        }
        # (8 unchanged attributes hidden)
    }

  # module.security.aws_security_group.nlb_api must be replaced
-/+ resource "aws_security_group" "nlb_api" {
      ~ arn                    = "arn:aws:ec2:ap-south-1:478468757808:security-group/sg-0b0d4dba43b6333e3" -> (known after apply)
      ~ description            = "Security group for NLB - K8s API access from bastion" -> "Security group for NLB - K8s API, staging apps, ArgoCD UI" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.0.10.0/24",
                  - "10.0.11.0/24",
                  - "10.0.12.0/24",
                ]
              - description      = "Forward K8s API to control plane targets"
              - from_port        = 6443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 6443
            },
          + {
              + cidr_blocks      = [
                  + "10.0.10.0/24",
                  + "10.0.11.0/24",
                  + "10.0.12.0/24",
                ]
              + description      = "Forward K8s API to control plane"
              + from_port        = 6443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6443
            },
          + {
              + cidr_blocks      = [
                  + "10.0.10.0/24",
                  + "10.0.11.0/24",
                  + "10.0.12.0/24",
                ]
              + description      = "Forward to worker nodes (NodePort range)"
              + from_port        = 30000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 32767
            },
        ]
      ~ id                     = "sg-0b0d4dba43b6333e3" -> (known after apply)
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "ArgoCD UI from bastion"
              + from_port        = 8443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0b8af5ccdc9c1d59a",
                ]
              + self             = false
              + to_port          = 8443
            },
          + {
              + cidr_blocks      = []
              + description      = "ArgoCD UI from dev server"
              + from_port        = 8443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0d67ff044a38749c1",
                ]
              + self             = false
              + to_port          = 8443
            },
          + {
              + cidr_blocks      = []
              + description      = "HTTP from bastion"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0b8af5ccdc9c1d59a",
                ]
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "HTTP from dev server"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0d67ff044a38749c1",
                ]
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "HTTPS from bastion"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0b8af5ccdc9c1d59a",
                ]
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "HTTPS from dev server"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0d67ff044a38749c1",
                ]
              + self             = false
              + to_port          = 443
            },
            # (2 unchanged elements hidden)
        ]
      ~ name                   = "kubestock-sg-nlb-api" -> "kubestock-sg-nlb" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "478468757808" -> (known after apply)
      ~ tags                   = {
          ~ "Name" = "kubestock-sg-nlb-api" -> "kubestock-sg-nlb"
        }
      ~ tags_all               = {
          ~ "Name"        = "kubestock-sg-nlb-api" -> "kubestock-sg-nlb"
            # (3 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

Plan: 13 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ dev_server_public_ip               = "65.2.130.219" -> (known after apply)
  ~ dev_server_ssh_command             = "ssh -i ~/.ssh/kubestock-key ubuntu@65.2.130.219" -> (known after apply)
  ~ k8s_api_endpoint                   = "kubestock-nlb-api-9f36c11b9d916d59.elb.ap-south-1.amazonaws.com:6443" -> (known after apply)
  ~ nlb_arn                            = "arn:aws:elasticloadbalancing:ap-south-1:478468757808:loadbalancer/net/kubestock-nlb-api/9f36c11b9d916d59" -> (known after apply)
  ~ nlb_dns_name                       = "kubestock-nlb-api-9f36c11b9d916d59.elb.ap-south-1.amazonaws.com" -> (known after apply)
  ~ sg_nlb_api_id                      = "sg-0b0d4dba43b6333e3" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```

  </details>
        